In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

In [35]:
idx_arr = [['a', 'a', 'b', 'b', 'c', 'c'], [1, 2, 1, 2, 1, 2]]
index = list(zip(*idx_arr))
index
multi_index = pd.MultiIndex.from_tuples(index, names=["first", "second"])
data = pd.Series(data=[1, 2, np.nan, 4, 5, 6], index=multi_index)
print(data.loc["b", 1:2])
print(data["b"][0:])

first  second
b      1         NaN
       2         4.0
dtype: float64
second
1    NaN
2    4.0
dtype: float64

In [37]:
data

first  second
a      1         1.0
       2         2.0
b      1         NaN
       2         4.0
c      1         5.0
       2         6.0
dtype: float64

In [44]:
ds = data.unstack() # to convert series to a dataframe, pivot table
print(type(ds))

<class 'pandas.core.frame.DataFrame'>

In [75]:
# multiindex on columns
data = pd.DataFrame(data=np.random.randint(0,10,size=16).reshape(4,4),
index = [["a", "a", "b", "b"], [1, 2, 1, 2, ]],
columns=[["ohio","ohio","or", "or"], ["green", "red", "green", "red"]])

In [76]:
data

     ohio        or
    green red green red
a 1     1   6     3   2
  2     9   2     3   3
b 1     1   4     0   7
  2     9   6     6   7

In [77]:
data.columns.names = ["state", "color"]
data.index.names = ["f", "s"]
data

state  ohio        or
color green red green red
f s
a 1       1   6     3   2
  2       9   2     3   3
b 1       1   4     0   7
  2       9   6     6   7

In [78]:
data.swaplevel("f", "s")

state  ohio        or
color green red green red
s f
1 a       1   6     3   2
2 a       9   2     3   3
1 b       1   4     0   7
2 b       9   6     6   7

In [79]:
data.swaplevel("state", "color", axis=1)

color green  red green red
state  ohio ohio    or  or
f s
a 1       1    6     3   2
  2       9    2     3   3
b 1       1    4     0   7
  2       9    6     6   7

In [82]:
data.sort_index(level=1)

state  ohio        or
color green red green red
f s
a 1       1   6     3   2
b 1       1   4     0   7
a 2       9   2     3   3
b 2       9   6     6   7

In [85]:
data

state  ohio        or
color green red green red
f s
a 1       1   6     3   2
  2       9   2     3   3
b 1       1   4     0   7
  2       9   6     6   7

In [86]:
data.reset_index() # makes named indexes as columns

state  f  s  ohio        or
color       green red green red
0      a  1     1   6     3   2
1      a  2     9   2     3   3
2      b  1     1   4     0   7
3      b  2     9   6     6   7

In [88]:
data

state  ohio        or
color green red green red
f s
a 1       1   6     3   2
  2       9   2     3   3
b 1       1   4     0   7
  2       9   6     6   7

In [87]:
data.groupby(level="f").sum()

state  ohio        or
color green red green red
f
a        10   8     6   5
b        10  10     6  14

In [90]:
data.groupby("state", axis=1).sum()

state  ohio  or
f s
a 1       7   5
  2      11   6
b 1       5   7
  2      15  13

In [22]:
data = pd.Series(data=[1, 2, np.nan, 4, 5, 6], index=idx_arr)
data

a  1    1.0
   2    2.0
b  1    NaN
   2    4.0
c  1    5.0
   2    6.0
dtype: float64

In [23]:

data = pd.Series(data=[1, 2, np.nan, 4, 5, 6], index={'first':idx_arr[0], 'second': idx_arr[1]})
data

ValueError: Length of values (6) does not match length of index (2)